AirVentsCadWpf/Service References/ServiceReference2/BomTableService.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="http://tempuri.org/" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="BomTableService" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <xs:schema elementFormDefault="qualified" targetNamespace="http://tempuri.org/" xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:import namespace="http://schemas.datacontract.org/2004/07/BomPartList" />
      <xs:element name="SayHello">
        <xs:complexType>
          <xs:sequence>
            <xs:element minOccurs="0" name="name" nillable="true" type="xs:string" />
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="SayHelloResponse">
        <xs:complexType>
          <xs:sequence>
            <xs:element minOccurs="0" name="SayHelloResult" nillable="true" type="xs:string" />
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="BomParts">
        <xs:complexType>
          <xs:sequence>
            <xs:element minOccurs="0" name="assemblyPath" nillable="true" type="xs:string" />
            <xs:element minOccurs="0" name="pdmBaseName" nillable="true" type="xs:string" />
            <xs:element minOccurs="0" name="userName" nillable="true" type="xs:string" />
            <xs:element minOccurs="0" name="password" nillable="true" type="xs:string" />
            <xs:element minOccurs="0" name="constring" nillable="true" type="xs:string" />
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="BomPartsResponse">
        <xs:complexType>
          <xs:sequence>
            <xs:element xmlns:q1="http://schemas.datacontract.org/2004/07/BomPartList" minOccurs="0" name="BomPartsResult" nillable="true" type="q1:ArrayOfBomPartListClass.BomCells" />
          </xs:sequence>
        </xs:complexType>
      </xs:element>
    </xs:schema>
    <xs:schema xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/" attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:element name="anyType" nillable="true" type="xs:anyType" />
      <xs:element name="anyURI" nillable="true" type="xs:anyURI" />
      <xs:element name="base64Binary" nillable="true" type="xs:base64Binary" />
      <xs:element name="boolean" nillable="true" type="xs:boolean" />
      <xs:element name="byte" nillable="true" type="xs:byte" />
      <xs:element name="dateTime" nillable="true" type="xs:dateTime" />
      <xs:element name="decimal" nillable="true" type="xs:decimal" />
      <xs:element name="double" nillable="true" type="xs:double" />
      <xs:element name="float" nillable="true" type="xs:float" />
      <xs:element name="int" nillable="true" type="xs:int" />
      <xs:element name="long" nillable="true" type="xs:long" />
      <xs:element name="QName" nillable="true" type="xs:QName" />
      <xs:element name="short" nillable="true" type="xs:short" />
      <xs:element name="string" nillable="true" type="xs:string" />
      <xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte" />
      <xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt" />
      <xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong" />
      <xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort" />
      <xs:element name="char" nillable="true" type="tns:char" />
      <xs:simpleType name="char">
        <xs:restriction base="xs:int" />
      </xs:simpleType>
      <xs:element name="duration" nillable="true" type="tns:duration" />
      <xs:simpleType name="duration">
        <xs:restriction base="xs:duration">
          <xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?" />
          <xs:minInclusive value="-P10675199DT2H48M5.4775808S" />
          <xs:maxInclusive value="P10675199DT2H48M5.4775807S" />
        </xs:restriction>
      </xs:simpleType>
      <xs:element name="guid" nillable="true" type="tns:guid" />
      <xs:simpleType name="guid">
        <xs:restriction base="xs:string">
          <xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}" />
        </xs:restriction>
      </xs:simpleType>
      <xs:attribute name="FactoryType" type="xs:QName" />
      <xs:attribute name="Id" type="xs:ID" />
      <xs:attribute name="Ref" type="xs:IDREF" />
    </xs:schema>
    <xs:schema xmlns:tns="http://schemas.datacontract.org/2004/07/BomPartList" elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/BomPartList" xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:complexType name="ArrayOfBomPartListClass.BomCells">
        <xs:sequence>
          <xs:element minOccurs="0" maxOccurs="unbounded" name="BomPartListClass.BomCells" nillable="true" type="tns:BomPartListClass.BomCells" />
        </xs:sequence>
      </xs:complexType>
      <xs:element name="ArrayOfBomPartListClass.BomCells" nillable="true" type="tns:ArrayOfBomPartListClass.BomCells" />
      <xs:complexType name="BomPartListClass.BomCells">
        <xs:sequence>
          <xs:element minOccurs="0" name="Errors" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="MaterialDocMgr" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="АссоциированныйОбъект" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="Количество" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="Конфигурация" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="Материал" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="МатериалЦми" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="МатериалЦмиDocMgr" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="Наименование" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="НаименованиеDocMgr" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="Обозначение" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="ОбозначениеDocMgr" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="ПоследняяВерсия" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="Путь" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="Раздел" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="РазделDocMgr" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="ТипФайла" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="ТолщинаЛиста" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="ТолщинаЛистаDocMgr" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="Уровень" nillable="true" type="xs:string" />
        </xs:sequence>
      </xs:complexType>
      <xs:element name="BomPartListClass.BomCells" nillable="true" type="tns:BomPartListClass.BomCells" />
    </xs:schema>
  </wsdl:types>
  <wsdl:message name="IBomTableService_SayHello_InputMessage">
    <wsdl:part name="parameters" element="tns:SayHello" />
  </wsdl:message>
  <wsdl:message name="IBomTableService_SayHello_OutputMessage">
    <wsdl:part name="parameters" element="tns:SayHelloResponse" />
  </wsdl:message>
  <wsdl:message name="IBomTableService_BomParts_InputMessage">
    <wsdl:part name="parameters" element="tns:BomParts" />
  </wsdl:message>
  <wsdl:message name="IBomTableService_BomParts_OutputMessage">
    <wsdl:part name="parameters" element="tns:BomPartsResponse" />
  </wsdl:message>
  <wsdl:portType name="IBomTableService">
    <wsdl:operation name="SayHello">
      <wsdl:input wsam:Action="http://tempuri.org/IBomTableService/SayHello" message="tns:IBomTableService_SayHello_InputMessage" />
      <wsdl:output wsam:Action="http://tempuri.org/IBomTableService/SayHelloResponse" message="tns:IBomTableService_SayHello_OutputMessage" />
    </wsdl:operation>
    <wsdl:operation name="BomParts">
      <wsdl:input wsam:Action="http://tempuri.org/IBomTableService/BomParts" message="tns:IBomTableService_BomParts_InputMessage" />
      <wsdl:output wsam:Action="http://tempuri.org/IBomTableService/BomPartsResponse" message="tns:IBomTableService_BomParts_OutputMessage" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="BasicHttpBinding_IBomTableService" type="tns:IBomTableService">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="SayHello">
      <soap:operation soapAction="http://tempuri.org/IBomTableService/SayHello" style="document" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="BomParts">
      <soap:operation soapAction="http://tempuri.org/IBomTableService/BomParts" style="document" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="BomTableService">
    <wsdl:port name="BasicHttpBinding_IBomTableService" binding="tns:BasicHttpBinding_IBomTableService">
      <soap:address location="http://192.168.14.86:8080/bomtable" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>